adw-gtk-theme
amd-ucode
atuin
bandwhich
base
base-devel
bluez
bluez-utils
btop
btrfs-assistant
btrfs-progs
chezmoi
cliphist
efibootmgr
evtest
ex-vi-compat
fastfetch
firefox
fwupd
git
github-cli
gnome-keyring
greetd
greetd-tuigreet
grub-btrfs
jq
kitty
less
limine
linux
linux-firmware
linux-lts
mise
mpv
nano
neovim
networkmanager
nftables
niri
noto-fonts-emoji
nvidia-open
nvidia-open-lts
nvidia-settings
nvidia-utils
nvtop
nwg-look
obs-studio
pipewire-alsa
pipewire-pulse
playerctl
power-profiles-daemon
qt5ct
qt6ct
reflector
ripgrep
sbctl
seahorse
seatd
snap-pac
snapper
spotify-launcher
sudo
swappy
swayidle
swayimg
swaylock
ttf-jetbrains-mono-nerd
usbutils
v4l2loopback-dkms
vulkan-icd-loader
wl-clipboard
wlopm
xdg-desktop-portal-gnome
xdg-desktop-portal-wlr
xdg-user-dirs
xdg-utils
xwayland-satellite
zoxide
zsh
zsh-autosuggestions
zsh-syntax-highlighting
