# Curated portable baseline for this desktop setup.
# Keep this hardware-agnostic. Exact local exports live in snapshot files.

# Base tooling
base
base-devel
sudo
openssh
git
github-cli
chezmoi
jq
ripgrep
mise

# Shell and editor
zsh
zsh-autosuggestions
zsh-syntax-highlighting
atuin
zoxide
neovim
less
nano

# Session and desktop
networkmanager
greetd
greetd-tuigreet
seatd
niri
kitty
polkit-kde-agent
gnome-keyring
seahorse
xwayland-satellite
xdg-user-dirs
xdg-utils
xdg-desktop-portal-gnome
xdg-desktop-portal-wlr
qt5ct
qt6ct
adw-gtk-theme

# Fonts
noto-fonts-emoji
ttf-jetbrains-mono-nerd

# Audio and media
pipewire-alsa
pipewire-pulse
playerctl
firefox
mpv
obs-studio
vulkan-icd-loader

# Wayland workflow tools
wl-clipboard
cliphist
brightnessctl
swappy
swayidle
swaylock
